main.py

import requests
import xmltodict
# URL do serviço SOAP
url = "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso"

# XML estruturado
payload = """<?xml version=\"1.0\" encoding=\"utf-8\"?>
			<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">
				<soap:Body>
					<CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo">
                        <sCountryISOCode>BR</sCountryISOCode>
                    </CapitalCity>
				</soap:Body>
			</soap:Envelope>
            
            """
headers = {
	'Content-Type': 'text/xml; charset=utf-8'
}
# request POST
response = requests.request("POST", url, headers=headers, data=payload)

# imprime a resposta

todic = xmltodict.parse(response.text)
print(todic['soap:Envelope']['soap:Body']['m:CapitalCityResponse']['m:CapitalCityResult']) 
